# Pandas
- Python library for Data Analysis and Manipulation


## Why Pandas?
- provides ability to work with Tabular data.
- **Tabular Data** - data that is organized into tables having rows and cols

In [1]:
!pip install Pandas

Requirement already satisfied: Pandas in c:\users\asus\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\asus\anaconda3\lib\site-packages (from Pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\asus\anaconda3\lib\site-packages (from Pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\asus\anaconda3\lib\site-packages (from Pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\asus\anaconda3\lib\site-packages (from Pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\asus\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->Pandas) (1.16.0)

In [1]:
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [2]:
book_title = ['C++', 'Java', 'Python', 'JavaScript']

In [3]:
b_series = pd.Series(book_title)

In [4]:
type(b_series)

pandas.core.series.Series

In [5]:
b_series

0           C++
1          Java
2        Python
3    JavaScript
dtype: object

In [6]:
b_series[2]

'Python'

In [7]:
b_series[1:4]

1          Java
2        Python
3    JavaScript
dtype: object

In [9]:
b_series.index=['a','b','c','d']

In [10]:
b_series

a           C++
b          Java
c        Python
d    JavaScript
dtype: object

In [11]:
b_series['+':'-']

Series([], dtype: object)

In [12]:
b_series.index=['*',"+",'-','$']

# DataFrame - Introduction
- 2D labelled array having index and columns.
- multiple series combined together to form a Dataframe.
- most widely used data structure in pandas

In [8]:
import numpy as np

In [9]:
df = pd.DataFrame(np.random.randint(1,20,(5,3)))

In [10]:
df

    0   1   2
0  12  11  19
1   1  15  15
2   9  11   9
3  17  10  13
4   5  18   9

In [11]:
df.columns=['Col1','Col2','Col3']

In [12]:
df

   Col1  Col2  Col3
0    12    11    19
1     1    15    15
2     9    11     9
3    17    10    13
4     5    18     9

In [13]:
df.index=['A','B','C','D',"E"]

In [14]:
df['Col2']['E']  #df[column][row]

18

In [15]:
df[['Col2','Col3']]

   Col2  Col3
A    11    19
B    15    15
C    11     9
D    10    13
E    18     9

In [16]:
df[['Col3','Col3']]

   Col3  Col3
A    19    19
B    15    15
C     9     9
D    13    13
E     9     9

In [17]:
df.shape

(5, 3)

In [18]:
df.head()

   Col1  Col2  Col3
A    12    11    19
B     1    15    15
C     9    11     9
D    17    10    13
E     5    18     9

In [19]:
df.head(2)

   Col1  Col2  Col3
A    12    11    19
B     1    15    15

In [20]:
df.tail()

   Col1  Col2  Col3
A    12    11    19
B     1    15    15
C     9    11     9
D    17    10    13
E     5    18     9

In [21]:
df.tail(3)

   Col1  Col2  Col3
C     9    11     9
D    17    10    13
E     5    18     9

In [22]:
df.sample()

   Col1  Col2  Col3
D    17    10    13

In [23]:
df.sample(3)

   Col1  Col2  Col3
A    12    11    19
E     5    18     9
D    17    10    13

In [24]:
df

   Col1  Col2  Col3
A    12    11    19
B     1    15    15
C     9    11     9
D    17    10    13
E     5    18     9

In [25]:
df['Col4']= df['Col1']+df['Col2'] #Adding new column

In [26]:
import random
df['Col5']= np.random.randint(1,5,(5,1))

In [27]:
df

   Col1  Col2  Col3  Col4  Col5
A    12    11    19    23     4
B     1    15    15    16     2
C     9    11     9    20     4
D    17    10    13    27     3
E     5    18     9    23     3

In [28]:
df=df.drop('Col4',axis=1)

In [29]:
df

   Col1  Col2  Col3  Col5
A    12    11    19     4
B     1    15    15     2
C     9    11     9     4
D    17    10    13     3
E     5    18     9     3

In [30]:
df.drop(['Col1','Col5'],axis=1,inplace=True)

In [31]:
df

   Col2  Col3
A    11    19
B    15    15
C    11     9
D    10    13
E    18     9

In [32]:
df.drop('E',inplace=True)

In [33]:
df

   Col2  Col3
A    11    19
B    15    15
C    11     9
D    10    13

In [34]:
df.iloc[2:4,1:3]

   Col3
C     9
D    13

In [35]:
df.loc['A':'B','Col2':'Col3']

   Col2  Col3
A    11    19
B    15    15

In [36]:
df.iloc[0:2,1:3]

   Col3
A    19
B    15

In [ ]:
df.loc[0:3,'Col2':'Col3']

In [ ]:
df

In [ ]:
mask=df>10

In [ ]:
df[df>10]

In [ ]:
df[df['Col1'] >10]

In [ ]:
# extracting values from Col Col2 and col3 where Col1 column has value >10
df[ df['Col1'] > 10 ][['Col2','Col3']]

In [ ]:
df

In [ ]:
df[(df['Col1']>5) & (df['Col2']<15)]

In [ ]:
df.values

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Col2    4 non-null      int32
 1   Col3    4 non-null      int32
dtypes: int32(2)
memory usage: 236.0+ bytes

In [38]:
df.describe()

            Col2       Col3
count   4.000000   4.000000
mean   11.750000  14.000000
std     2.217356   4.163332
min    10.000000   9.000000
25%    10.750000  12.000000
50%    11.000000  14.000000
75%    12.000000  16.000000
max    15.000000  19.000000

In [39]:
iris=pd.read_csv("iris.csv")

In [40]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [41]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [42]:
iris.tail()

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [43]:
iris.shape

(150, 5)

In [44]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [45]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [46]:
iris.isnull().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [47]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [48]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [49]:
iris['species'].nunique()

3

In [50]:
iris.describe(include='all')

        sepal_length  sepal_width  petal_length  petal_width species
count     150.000000   150.000000    150.000000   150.000000     150
unique           NaN          NaN           NaN          NaN       3
top              NaN          NaN           NaN          NaN  setosa
freq             NaN          NaN           NaN          NaN      50
mean        5.843333     3.054000      3.758667     1.198667     NaN
std         0.828066     0.433594      1.764420     0.763161     NaN
min         4.300000     2.000000      1.000000     0.100000     NaN
25%         5.100000     2.800000      1.600000     0.300000     NaN
50%         5.800000     3.000000      4.350000     1.300000     NaN
75%         6.400000     3.300000      5.100000     1.800000     NaN
max         7.900000     4.400000      6.900000     2.500000     NaN

In [51]:
iris['species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: species, dtype: int64

In [52]:
iris['species'].value_counts()['versicolor']

50

In [53]:
round(iris['species'].value_counts(normalize=True),2)

setosa        0.33
versicolor    0.33
virginica     0.33
Name: species, dtype: float64

In [54]:
iris['sepal_length'].mean()

5.843333333333334

In [55]:
iris['sepal_length'].min()

4.3

In [56]:
iris['sepal_length'].max()

7.9

In [57]:
iris['sepal_length'].sum()

876.5

In [58]:
iris.sort_values(by=["sepal_length", "sepal_width"],ascending=False)

     sepal_length  sepal_width  petal_length  petal_width    species
131           7.9          3.8           6.4          2.0  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
..            ...          ...           ...          ...        ...
41            4.5          2.3           1.3          0.3     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
13            4.3          3.0           1.1          0.1     setosa

[150 rows x 5 columns]

In [59]:
def s_upper(x):
    return x.upper()

In [60]:
iris['species'].apply(s_upper)

0         SETOSA
1         SETOSA
2         SETOSA
3         SETOSA
4         SETOSA
         ...
145    VIRGINICA
146    VIRGINICA
147    VIRGINICA
148    VIRGINICA
149    VIRGINICA
Name: species, Length: 150, dtype: object

In [61]:
iris['species'].apply(len)

0      6
1      6
2      6
3      6
4      6
      ..
145    9
146    9
147    9
148    9
149    9
Name: species, Length: 150, dtype: int64

In [ ]:
iris['species'].apply(lambda x: x.upper())

In [ ]:
iris.apply(lambda x: x + x)

In [46]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [49]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

# Grouping Data Together

In [52]:
iris[['sepal_length', 'sepal_width', 'petal_length', 'petal_width']].agg(['sum','min'])

     sepal_length  sepal_width  petal_length  petal_width
sum         876.5        458.1         563.8        179.8
min           4.3          2.0           1.0          0.1

In [53]:
iris[['sepal_length', 'sepal_width', 'petal_length', 'petal_width']].aggregate(['min', 'max', 'mean', 'median'])

        sepal_length  sepal_width  petal_length  petal_width
min         4.300000        2.000      1.000000     0.100000
max         7.900000        4.400      6.900000     2.500000
mean        5.843333        3.054      3.758667     1.198667
median      5.800000        3.000      4.350000     1.300000

In [56]:
sp_group=iris.groupby('species')

In [58]:
sp_group.count()

            sepal_length  sepal_width  petal_length  petal_width
species
setosa                50           50            50           50
versicolor            50           50            50           50
virginica             50           50            50           50

In [60]:
sp_group.describe().T

species                setosa  versicolor  virginica
sepal_length count  50.000000   50.000000  50.000000
             mean    5.006000    5.936000   6.588000
             std     0.352490    0.516171   0.635880
             min     4.300000    4.900000   4.900000
             25%     4.800000    5.600000   6.225000
             50%     5.000000    5.900000   6.500000
             75%     5.200000    6.300000   6.900000
             max     5.800000    7.000000   7.900000
sepal_width  count  50.000000   50.000000  50.000000
             mean    3.418000    2.770000   2.974000
             std     0.381024    0.313798   0.322497
             min     2.300000    2.000000   2.200000
             25%     3.125000    2.525000   2.800000
             50%     3.400000    2.800000   3.000000
             75%     3.675000    3.000000   3.175000
             max     4.400000    3.400000   3.800000
petal_length count  50.000000   50.000000  50.000000
             mean    1.464000    4.260000   5.552000
             std     0.173511    0.469911   0.551895
             min     1.000000    3.000000   4.500000
             25%     1.400000    4.000000   5.100000
             50%     1.500000    4.350000   5.550000
             75%     1.575000    4.600000   5.875000
             max     1.900000    5.100000   6.900000
petal_width  count  50.000000   50.000000  50.000000
             mean    0.244000    1.326000   2.026000
             std     0.107210    0.197753   0.274650
             min     0.100000    1.000000   1.400000
             25%     0.200000    1.200000   1.800000
             50%     0.200000    1.300000   2.000000
             75%     0.300000    1.500000   2.300000
             max     0.600000    1.800000   2.500000

# Handling Missing Data
- dropna()
- fillna()

In [61]:
nan_idx = np.random.randint(0, 150, 20)
iris['sepal_length'][nan_idx] = np.nan

In [64]:
iris.isna().sum()

sepal_length    19
sepal_width      0
petal_length     0
petal_width      0
species          0
dtype: int64

In [65]:
iris.isnull().sum()

sepal_length    19
sepal_width      0
petal_length     0
petal_width      0
species          0
dtype: int64

In [66]:
iris.shape

(150, 5)

In [69]:
iris.dropna(inplace=True)

In [70]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
144           6.7          3.3           5.7          2.5  virginica
145           6.7          3.0           5.2          2.3  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[131 rows x 5 columns]

In [71]:
iris.isnull().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [73]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [74]:
nan_idx = np.random.randint(0, 150, 20)
iris['sepal_length'][nan_idx] = np.nan

In [85]:
iris['sepal_length'].isna().sum()

18

In [78]:
nan_idx

array([133,  77,  12, 110, 132,  95,  68,  75, 111,  35,  47,  28,  45,
        29,  83,  45,  95,  74,  52,  49])

In [89]:
iris['sepal_length'][nan_idx]

133    5.850758
77     5.850758
12     5.850758
110    5.850758
132    5.850758
95     5.850758
68     5.850758
75     5.850758
111    5.850758
35     5.850758
47     5.850758
28     5.850758
45     5.850758
29     5.850758
83     5.850758
45     5.850758
95     5.850758
74     5.850758
52     5.850758
49     5.850758
Name: sepal_length, dtype: float64

In [88]:
iris['sepal_length'].fillna(value=np.mean(iris['sepal_length']),inplace=True)

In [90]:
iris['sepal_length'][nan_idx]

133    5.850758
77     5.850758
12     5.850758
110    5.850758
132    5.850758
95     5.850758
68     5.850758
75     5.850758
111    5.850758
35     5.850758
47     5.850758
28     5.850758
45     5.850758
29     5.850758
83     5.850758
45     5.850758
95     5.850758
74     5.850758
52     5.850758
49     5.850758
Name: sepal_length, dtype: float64

In [91]:
iris['petal_length'][:50]  #50 rows of specified column

0     1.4
1     1.4
2     1.3
3     1.5
4     1.4
5     1.7
6     1.4
7     1.5
8     1.4
9     1.5
10    1.5
11    1.6
12    1.4
13    1.1
14    1.2
15    1.5
16    1.3
17    1.4
18    1.7
19    1.5
20    1.7
21    1.5
22    1.0
23    1.7
24    1.9
25    1.6
26    1.6
27    1.5
28    1.4
29    1.6
30    1.6
31    1.5
32    1.5
33    1.4
34    1.5
35    1.2
36    1.3
37    1.5
38    1.3
39    1.5
40    1.3
41    1.3
42    1.3
43    1.6
44    1.9
45    1.4
46    1.6
47    1.4
48    1.5
49    1.4
Name: petal_length, dtype: float64

# Concat/Merge Dataframes

In [92]:
new_df = pd.DataFrame( np.random.randint(0, 7, size=(10, 4)))

In [93]:
new_df

   0  1  2  3
0  3  4  4  5
1  0  4  1  3
2  3  5  3  2
3  2  2  1  0
4  2  6  5  2
5  2  4  1  1
6  6  5  1  0
7  5  1  1  1
8  2  0  1  4
9  1  2  0  5

In [94]:
new_df['species'] = "new-species"

In [95]:
new_df.head()

   0  1  2  3      species
0  3  4  4  5  new-species
1  0  4  1  3  new-species
2  3  5  3  2  new-species
3  2  2  1  0  new-species
4  2  6  5  2  new-species

In [96]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [97]:
new_df.columns = iris.columns

In [98]:
new_df.head()

   sepal_length  sepal_width  petal_length  petal_width      species
0             3            4             4            5  new-species
1             0            4             1            3  new-species
2             3            5             3            2  new-species
3             2            2             1            0  new-species
4             2            6             5            2  new-species

In [99]:

iris = pd.concat((iris, new_df), axis=0 )

In [100]:
iris.shape

(160, 5)

# Merging Dataframes

In [101]:
df1 = pd.DataFrame({'S_Name' : ['Mohit', 'Jatin', 'Prateek', 'Mohit'],
                    'CGPA' :  [ 2 , 4, 5, 3]})

df1

    S_Name  CGPA
0    Mohit     2
1    Jatin     4
2  Prateek     5
3    Mohit     3

In [102]:
df2 = pd.DataFrame({'T_Name' : ['Mohit', 'Jatin', 'Prateek', 'Mohit'],
                    'CGPA' :  [ 3 , 6, 8, 9]})

df2

    T_Name  CGPA
0    Mohit     3
1    Jatin     6
2  Prateek     8
3    Mohit     9

In [103]:
df1.merge(df2, how = 'inner')

  S_Name  CGPA T_Name
0  Mohit     3  Mohit

In [104]:
df1.merge(df2, how = 'left')

    S_Name  CGPA T_Name
0    Mohit     2    NaN
1    Jatin     4    NaN
2  Prateek     5    NaN
3    Mohit     3  Mohit

In [105]:
df1.merge(df2, how= 'right')

  S_Name  CGPA   T_Name
0  Mohit     3    Mohit
1    NaN     6    Jatin
2    NaN     8  Prateek
3    NaN     9    Mohit

In [106]:
df1.merge(df2, how= 'outer')

    S_Name  CGPA   T_Name
0    Mohit     2      NaN
1    Jatin     4      NaN
2  Prateek     5      NaN
3    Mohit     3    Mohit
4      NaN     6    Jatin
5      NaN     8  Prateek
6      NaN     9    Mohit

# Output Files

In [107]:
iris.to_csv('./modified_iris.csv', index=False)
iris.to_excel("./new_iris.xlsx", sheet_name="iris sheet")

modified_iris = pd.read_csv('./modified_iris.csv')

modified_iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa